info = {
    "name": "ru",
    "date_order": "DMY",
    "january": [
        "янв",
        "январь",
        "января",
        "январе",
        "январю",
    ],
    "february": [
        "февр",
        "февраль",
        "февраля",
        "феврале",
        "февралю",
        "фев"
    ],
    "march": [
        "мар",
        "март",
        "марта",
        "марту",
        "марте"
    ],
    "april": [
        "апр",
        "апрель",
        "апреля",
        "апреле",
        "апрелю",
    ],
    "may": [
        "май",
        "мая",
        "маю",
        "мае",
        "майский",
        "майские"
    ],
    "june": [
        "июн",
        "июнь",
        "июня",
        "июню",
        "июне"
    ],
    "july": [
        "июл",
        "июль",
        "июлю",
        "июле",
        "июля"
    ],
    "august": [
        "авг",
        "август",
        "августа",
        "августу",
        "августе"
    ],
    "september": [
        "сент",
        "сентябрь",
        "сентября",
        "сентябрю",
        "сентябре",
        "сен"
    ],
    "october": [
        "окт",
        "октябрь",
        "октябрю",
        "октябре",
        "октября"
    ],
    "november": [
        "нояб",
        "ноябрь",
        "ноября",
        "ноябрю",
        "ноябре",
        "ноя"
    ],
    "december": [
        "дек",
        "декабрь",
        "декабре",
        "декабрю",
        "декабря"
    ],
    "monday": [
        "пн",
        "понедельник",
        "понедельнику",
        "понедельника"
    ],
    "tuesday": [
        "вт",
        "вторник",
        "вторнику",
        "вторника"
    ],
    "wednesday": [
        "ср",
        "среда",
        "среды",
        "среде",
        "среду"
    ],
    "thursday": [
        "четверг",
        "четвергу",
        "четверга",
        "чт"
    ],
    "friday": [
        "пт",
        "пятница",
        "пятницы",
        "пятнице",
        "пятницу"
    ],
    "saturday": [
        "сб",
        "суббота",
        "субботы",
        "субботе",
        "субботу"
    ],
    "sunday": [
        "воскресенье",
        "воскресения",
        "воскресенья",
        "воскресению",
        "воскресенью",
        "вс",
        "воскресение"
    ],
    "am": [
        "дп"
    ],
    "pm": [
        "пп"
    ],
    "year": [
        "г",
        "год",
        "года",
        "году",
        "лет"
    ],
    "month": [
        "мес",
        "месяц",
        "месяца",
        "месяцу",
        "месяцев"
    ],
    "week": [
        "нед",
        "неделя",
        "недели",
        "недель",
        "неделе",
        "неделю"
    ],
    "day": [
        "день",
        "дн",
        "дня",
        "дню",
        "дней",
        "сутки",
        "суток"
    ],
    "hour": [
        "ч",
        "час",
        "часа",
        "часов"
    ],
    "minute": [
        "мин",
        "минута",
        "минуты",
        "минуте",
        "минут",
        "минуту"
    ],
    "second": [
        "с",
        "сек",
        "секунда",
        "секунды",
        "секунде",
        "секунд",
        "секунду"
    ],
    "relative-type": {
        "0 day ago": [
            "сегодня"
        ],
        "0 hour ago": [
            "в этом часе"
        ],
        "0 minute ago": [
            "в эту минуту"
        ],
        "0 month ago": [
            "в этом месяце"
        ],
        "0 second ago": [
            "сейчас"
        ],
        "0 week ago": [
            "на этой неделе"
        ],
        "0 year ago": [
            "в этом году"
        ],
        "1 day ago": [
            "вчера"
        ],
        "1 month ago": [
            "в прошлом месяце"
        ],
        "1 week ago": [
            "на прошлой неделе"
        ],
        "1 year ago": [
            "в прошлом году"
        ],
        "in 1 day": [
            "завтра",
            "назавтра"
        ],
        "in 1 month": [
            "в следующем месяце"
        ],
        "in 1 week": [
            "на следующей неделе"
        ],
        "in 1 year": [
            "в следующем году"
        ],
        "2 day ago": [
            "позавчера"
        ],
        "in 2 day": [
            "послезавтра"
        ],
        "in 3 day": [
            "послепослезавтра"
        ]
    },
    "relative-type-regex": {
        "\\1 day ago": [
            "(\\d+) д назад",
            "(\\d+) день назад",
            "(\\d+) дн назад",
            "(\\d+) дня назад",
            "(\\d+) д тому назад",
            "(\\d+) день тому назад",
            "(\\d+) дн тому назад",
            "(\\d+) дня тому назад",
            "(\\d+) днями раньше",
            "(\\d+) днями ранее"
        ],
        "\\1 hour ago": [
            "(\\d+) ч назад",
            "(\\d+) час назад",
            "(\\d+) часа назад"
        ],
        "\\1 minute ago": [
            "(\\d+) мин назад",
            "(\\d+) минуту назад",
            "(\\d+) минуты назад"
        ],
        "\\1 month ago": [
            "(\\d+) мес назад",
            "(\\d+) месяц назад",
            "(\\d+) месяца назад"
        ],
        "\\1 second ago": [
            "(\\d+) сек назад",
            "(\\d+) секунду назад",
            "(\\d+) секунды назад"
        ],
        "\\1 week ago": [
            "(\\d+) нед назад",
            "(\\d+) недели назад",
            "(\\d+) неделю назад"
        ],
        "\\1 year ago": [
            "(\\d+) г назад",
            "(\\d+) год назад",
            "(\\d+) года назад"
        ],
        "in \\1 day": [
            "через (\\d+) д",
            "через (\\d+) день",
            "через (\\d+) дн",
            "через (\\d+) дня",
        ],
        "in \\1 hour": [
            "через (\\d+) ч",
            "через (\\d+) час",
            "через (\\d+) часа"
        ],
        "in \\1 minute": [
            "через (\\d+) мин",
            "через (\\d+) минуту",
            "через (\\d+) минуты"
        ],
        "in \\1 month": [
            "через (\\d+) мес",
            "через (\\d+) месяц",
            "через (\\d+) месяца"
        ],
        "in \\1 second": [
            "через (\\d+) сек",
            "через (\\d+) секунду",
            "через (\\d+) секунды"
        ],
        "in \\1 week": [
            "через (\\d+) нед",
            "через (\\d+) недели",
            "через (\\d+) неделю"
        ],
        "in \\1 year": [
            "через (\\d+) г",
            "через (\\d+) год",
            "через (\\d+) года"
        ]
    },
    "locale_specific": {
        "ru-BY": {
            "name": "ru-BY"
        },
        "ru-KG": {
            "name": "ru-KG"
        },
        "ru-KZ": {
            "name": "ru-KZ"
        },
        "ru-MD": {
            "name": "ru-MD"
        },
        "ru-UA": {
            "name": "ru-UA",
            "am": [
                "am"
            ],
            "pm": [
                "pm"
            ]
        }
    },
    "skip": [
        "около",
        "примерно",
        "ровно",
        "на",
        "к",
        "ко",
        "в",
        "во",
        "и",
        " ",
        ".",
        ",",
        ";",
        "-",
        "/",
        "'",
        "|",
        "@",
        "[",
        "]",
        "，"
    ],
    "sentence_splitter_group": 1,
    "ago": [
        "назад"
    ],
    "in": [
        "в течение",
        "спустя",
        "через"
    ],
    "simplifications": [
        {
            "од(на|ну|ни|ной|ин)": "1"
        },
        {
            "дв(а|е|ое|ух)": "2"
        },
        {
            "пар[ауы]": "2"
        },
        {
            "три": "3"
        },
        {
            "четыре": "4"
        },
        {
            "пять": "5"
        },
        {
            "шесть": "6"
        },
        {
            "семь": "7"
        },
        {
            "восемь": "8"
        },
        {
            "девять": "9"
        },
        {
            "десять": "10"
        },
        {
            "одиннадцать": "11"
        },
        {
            "двенадцать": "12"
        },
        {
            "пятнадцать": "15"
        },
        {
            "двадцать": "20"
        },
        {
            "тридцать": "30"
        },
        {
            "сорок": "40"
        },
        {
            "пятьдесят": "50"
        },
        {
            "несколько секунд": "44 секунды"
        },
        {
            "полчаса": "30 минут"
        },
        {
            "полгода": "6 месяцев"
        },
        {
            "полтора часа": "90 минут"
        },
        {
            "полтора года": "18 месяцев"
        },
        {
            "((?<=(через|спустя|в течение)\\s+)секунд[уы]|(?<=[^\\d]\\s+|^)секунду(?=(\\s+назад)))": "1 секунду"
        },
        {
            "((?<=(через|спустя|в течение)\\s+)минут[уы]|(?<=[^\\d]\\s+|^)минуту(?=(\\s+назад)))": "1 минуту"
        },
        {
            "((?<=(через|спустя|в течение)\\s+)часа?|(?<=[^\\d]\\s+|^)час(?=(\\s+назад)))": "1 час"
        },
        {
            "((?<=(через|спустя|в течение)\\s+)(день|дня)|(?<=[^\\d]\\s+|^)день(?=(\\s+назад)))": "1 день"
        },
        {
            "((?<=(через|спустя|в течение)\\s+)сут(ки|ок)|(?<=[^\\d]\\s+|^)сутки(?=(\\s+назад)))": "1 сутки"
        },
        {
            "((?<=(через|спустя|в течение)\\s+)недел[юи]|(?<=[^\\d]\\s+|^)неделю(?=(\\s+назад)))": "1 неделю"
        },
        {
            "((?<=(через|спустя|в течение)\\s+)месяца?|(?<=[^\\d]\\s+|^)месяц(?=(\\s+назад)))": "1 месяц"
        },
        {
            "((?<=(через|спустя|в течение)\\s+)года?|(?<=[^\\d]\\s+|^)год(?=(\\s+назад)))": "1 год"
        }
    ]
}
